{
  "cases": [
    {
      "id": "tiktok-divest-2024",
      "title": "TikTok divest-or-ban countdown",
      "context": "Congress passed the Protecting Americans from Foreign Adversary Controlled Applications Act in April, giving ByteDance until early 2025 to sell TikTok or face a U.S. ban. Reuters and the Washington Post report that the White House is drafting enforcement plans while creators warn of a cultural and economic shock.",
      "sideA": "National security hawks urge regulators to press ahead with a forced sale, citing intelligence briefings about data access by Beijing.",
      "sideB": "TikTok creators and civil liberties groups seek an injunction, arguing the law violates First Amendment protections and would devastate small businesses built on the platform.",
      "tags": ["tech", "national security", "speech"],
      "submittedBy": "newsroom_bot",
      "createdAt": "2024-04-23T13:15:00Z",
      "signals": {"upvotes": 1842, "downvotes": 1765, "reports": 42},
      "score": 78.6,
      "status": "inbox"
    },
    {
      "id": "nyc-congestion-delay",
      "title": "NYC congestion pricing pause backlash",
      "context": "Governor Hochul abruptly halted Manhattan's congestion pricing launch citing cost-of-living concerns. Gothamist and the New York Times note MTA planners had already installed gantries and budgeted billions for transit upgrades now left unfunded.",
      "sideA": "Transit advocates and climate groups ask the court to compel the toll's rollout, warning that the pause undermines legally adopted funding plans and emissions targets.",
      "sideB": "Suburban lawmakers seek an injunction against the toll, saying commuters need relief while inflation and high interest rates squeeze family budgets.",
      "tags": ["transportation", "climate", "finance"],
      "submittedBy": "civic_monitor",
      "createdAt": "2024-04-24T10:05:00Z",
      "signals": {"upvotes": 1290, "downvotes": 1184, "reports": 27},
      "score": 74.4,
      "status": "inbox"
    },
    {
      "id": "tesla-pay-revote",
      "title": "Tesla shareholder re-vote on Musk pay",
      "context": "After a Delaware judge voided Elon Musk's $56 billion compensation package, Tesla asked investors to reapprove it ahead of the annual meeting. CNBC and Bloomberg report funds are split over governance concerns versus keeping Musk focused on the automaker.",
      "sideA": "Tesla's board urges ratification, arguing Musk delivered on growth milestones and needs outsized incentives to pursue AI and robotics bets within Tesla.",
      "sideB": "Institutional investors led by CalPERS want the package scaled back with tighter performance triggers, saying the original plan diluted shareholders and concentrated power.",
      "tags": ["corporate governance", "automotive", "finance"],
      "submittedBy": "marketwatcher",
      "createdAt": "2024-04-25T15:42:00Z",
      "signals": {"upvotes": 954, "downvotes": 1002, "reports": 19},
      "score": 63.8,
      "status": "inbox"
    },
    {
      "id": "boeing-quality-hearing",
      "title": "Boeing safety oversight fight",
      "context": "Following the Alaska Airlines door plug blowout, FAA whistleblowers told the Senate that Boeing rushed production and retaliated against inspectors. NPR and the Wall Street Journal highlight renewed calls to ground additional jets until reforms stick.",
      "sideA": "Senate investigators push for an independent monitor and temporary production cap, claiming Boeing still prioritizes speed over safety.",
      "sideB": "Boeing and airline partners argue stricter oversight is underway already and warn sweeping shutdowns would snarl summer travel for millions.",
      "tags": ["aviation", "safety", "industry"],
      "submittedBy": "flightdeck",
      "createdAt": "2024-04-26T17:20:00Z",
      "signals": {"upvotes": 1411, "downvotes": 912, "reports": 33},
      "score": 70.9,
      "status": "inbox"
    },
    {
      "id": "campus-protest-crackdown",
      "title": "Campus protest crackdown debate",
      "context": "Dozens of universities called police to dismantle Gaza solidarity encampments, leading to mass arrests and faculty no-confidence votes. AP, CNN, and Inside Higher Ed document dueling pressure from donors, lawmakers, and civil liberties groups.",
      "sideA": "Student coalitions sue to block suspensions and demand amnesty, arguing administrators violated free speech commitments and relied on excessive force.",
      "sideB": "University trustees defend the clear-outs as necessary to protect safety and ensure finals proceed, citing harassment complaints and vandalism reports.",
      "tags": ["education", "speech", "public safety"],
      "submittedBy": "campuswatch",
      "createdAt": "2024-04-27T14:33:00Z",
      "signals": {"upvotes": 1734, "downvotes": 1668, "reports": 61},
      "score": 82.1,
      "status": "inbox"
    },
    {
      "id": "ai-voice-protection",
      "title": "AI voice cloning guardrails",
      "context": "Scarlett Johansson said OpenAI mimicked her voice after declining to license it, while SAG-AFTRA urged Congress to pass voice likeness protections. Variety and the Verge highlight studios experimenting with synthetic actors amid contract gray areas.",
      "sideA": "Performer unions want binding consent laws and statutory damages whenever AI voices emulate living actors without payment.",
      "sideB": "AI startups lobby for a fair-use carveout, claiming transformative training and short clips should remain legal to spur innovation.",
      "tags": ["entertainment", "ai", "labor"],
      "submittedBy": "voiceguard",
      "createdAt": "2024-04-28T11:18:00Z",
      "signals": {"upvotes": 1207, "downvotes": 978, "reports": 24},
      "score": 66.4,
      "status": "inbox"
    },
    {
      "id": "ftc-kroger-merger",
      "title": "FTC vs. Kroger-Albertsons",
      "context": "The Federal Trade Commission sued to block the $24.6 billion merger between Kroger and Albertsons, citing harm to grocery workers and consumers. The Denver Post and Axios report that unions fear store closures while the chains promise price drops.",
      "sideA": "FTC lawyers want a preliminary injunction, saying the merger would cut competition in dozens of metro areas and suppress wages.",
      "sideB": "The grocers argue divesting 413 stores to C&S Wholesale preserves competition and helps them take on Walmart and Amazon.",
      "tags": ["antitrust", "labor", "retail"],
      "submittedBy": "marketfair",
      "createdAt": "2024-04-29T09:05:00Z",
      "signals": {"upvotes": 832, "downvotes": 764, "reports": 13},
      "score": 58.2,
      "status": "inbox"
    },
    {
      "id": "google-ai-overviews",
      "title": "Google AI Overviews reliability",
      "context": "Google's AI Overviews search summaries went viral for suggesting people eat rocks and use glue on pizza, prompting corrections. The Verge and Wired report that publishers fear traffic loss while users question the feature's readiness.",
      "sideA": "Consumer advocates demand Google pause the rollout, insisting factual errors prove the tool is unsafe for public release.",
      "sideB": "Google defends the experiment, promising faster guardrails while arguing Overviews help users sift credible sources.",
      "tags": ["tech", "ai", "consumer"],
      "submittedBy": "searchdesk",
      "createdAt": "2024-04-30T16:12:00Z",
      "signals": {"upvotes": 1503, "downvotes": 1439, "reports": 35},
      "score": 73.5,
      "status": "inbox"
    },
    {
      "id": "amazon-ky-union",
      "title": "Amazon Kentucky union push",
      "context": "Workers at Amazon's Louisville air hub filed for a union election, citing heat and quota issues. The Courier Journal and NBC News say management launched mandatory meetings warning a union could slow raises and automation investments.",
      "sideA": "Union organizers ask the NLRB to stop captive-audience meetings and recognize the bargaining unit, pointing to rising injury rates.",
      "sideB": "Amazon argues direct engagement delivers faster fixes and says union dues would cut take-home pay without guaranteeing benefits.",
      "tags": ["labor", "logistics", "tech"],
      "submittedBy": "fulfillment_feed",
      "createdAt": "2024-05-01T08:45:00Z",
      "signals": {"upvotes": 978, "downvotes": 861, "reports": 21},
      "score": 60.7,
      "status": "inbox"
    },
    {
      "id": "nvidia-export-curbs",
      "title": "New U.S. chip export curbs debate",
      "context": "Bloomberg and the Financial Times report that Washington is weighing tighter controls on Nvidia's AI accelerators bound for China after discovering workarounds. Semiconductor firms warn allies may lose access if restrictions widen.",
      "sideA": "Security officials push for stricter licensing, arguing Chinese cloud firms still obtain advanced chips through resellers.",
      "sideB": "Chipmakers lobby for a lighter touch, saying unilateral U.S. limits will spur overseas competitors and hurt domestic R&D budgets.",
      "tags": ["technology", "trade", "security"],
      "submittedBy": "supplychain_eye",
      "createdAt": "2024-05-02T12:58:00Z",
      "signals": {"upvotes": 1104, "downvotes": 1009, "reports": 17},
      "score": 65.1,
      "status": "inbox"
    },
    {
      "id": "florida-book-ban-lawsuit",
      "title": "Florida book removals challenged",
      "context": "PEN America and Penguin Random House sued a Florida district after over 1,400 books were pulled under the state's new review law. USA Today and Miami Herald note parents are split between shielding kids and preserving diverse stories.",
      "sideA": "Authors and parents demand the court restore the books, saying the purge targets LGBTQ and racial history titles in violation of the First Amendment.",
      "sideB": "Moms for Liberty chapters defend the removals, arguing age-inappropriate content belongs in public libraries, not elementary classrooms.",
      "tags": ["education", "speech", "policy"],
      "submittedBy": "library_line",
      "createdAt": "2024-05-03T14:11:00Z",
      "signals": {"upvotes": 1673, "downvotes": 1544, "reports": 48},
      "score": 77.2,
      "status": "inbox"
    },
    {
      "id": "texas-sb4-immigration",
      "title": "Texas SB4 immigration showdown",
      "context": "Texas passed SB4 allowing state arrests for illegal entry, but federal courts paused enforcement while the Supreme Court weighs jurisdiction. AP and the Texas Tribune chronicle migrants' fear and border cities' competing demands.",
      "sideA": "Texas leaders push to activate SB4, claiming Washington abandoned border enforcement and local police need authority to act.",
      "sideB": "Immigrant advocates seek a permanent injunction, warning the law invites racial profiling and clashes with federal supremacy.",
      "tags": ["immigration", "states", "civil rights"],
      "submittedBy": "borderbeat",
      "createdAt": "2024-05-04T13:09:00Z",
      "signals": {"upvotes": 1905, "downvotes": 1826, "reports": 70},
      "score": 84.9,
      "status": "inbox"
    },
    {
      "id": "ohio-utility-solar",
      "title": "Ohio farmland solar moratorium",
      "context": "An Ohio county board moved to block new utility-scale solar farms after residents protested land leases. Cleveland.com and Energy News Network report farmers are divided over lease payments versus preserving cropland.",
      "sideA": "Climate coalitions ask the state to override the ban, arguing the moratorium undercuts Ohio's clean energy targets and federal subsidies.",
      "sideB": "Local preservation groups want the moratorium upheld, citing soil loss and concerns about foreign-owned developers.",
      "tags": ["energy", "rural", "environment"],
      "submittedBy": "heartland_watch",
      "createdAt": "2024-05-05T09:47:00Z",
      "signals": {"upvotes": 731, "downvotes": 688, "reports": 11},
      "score": 52.4,
      "status": "inbox"
    },
    {
      "id": "scotus-mifepristone-access",
      "title": "Supreme Court mifepristone access fight",
      "context": "Justices heard arguments over FDA rules easing access to the abortion pill mifepristone, with a ruling expected this summer. Politico and NPR say medical groups warn of chaos if approvals are rolled back while pro-life clinics claim safety lapses.",
      "sideA": "Anti-abortion doctors ask the Court to reinstate 2016 restrictions, citing adverse event reports and conscience concerns.",
      "sideB": "Reproductive health providers defend the FDA, saying decades of data prove the pill's safety and nationwide access is critical after Roe's reversal.",
      "tags": ["health", "courts", "reproductive rights"],
      "submittedBy": "scotusbrief",
      "createdAt": "2024-05-06T11:31:00Z",
      "signals": {"upvotes": 1820, "downvotes": 1755, "reports": 56},
      "score": 83.3,
      "status": "inbox"
    },
    {
      "id": "la-river-encampment",
      "title": "LA River encampment clearance",
      "context": "Los Angeles officials plan to clear a large homeless encampment along the LA River ahead of Olympic preparations. The Los Angeles Times and LAist report outreach teams clashed with residents who fear losing pets and belongings.",
      "sideA": "Housing advocates seek a restraining order, saying sweeps violate the city's settlement requiring shelter offers before enforcement.",
      "sideB": "City leaders cite flooding risks and public health hazards, arguing emergency powers allow them to remove structures before summer storms.",
      "tags": ["housing", "public safety", "local"],
      "submittedBy": "civicscope",
      "createdAt": "2024-05-07T18:26:00Z",
      "signals": {"upvotes": 987, "downvotes": 1034, "reports": 29},
      "score": 59.1,
      "status": "inbox"
    },
    {
      "id": "ukraine-aid-vote",
      "title": "Ukraine aid package standoff",
      "context": "After months of delay, Congress advanced a $61 billion Ukraine aid bill paired with TikTok divestment language. The Hill and BBC note voters are split on continued funding amid domestic budget fights.",
      "sideA": "Hawkish lawmakers push for immediate disbursement, warning Ukrainian forces are running low on air defense interceptors.",
      "sideB": "America First caucus members want aid converted to loans with strict oversight, arguing money should prioritize border security at home.",
      "tags": ["foreign policy", "defense", "budget"],
      "submittedBy": "hillbrief",
      "createdAt": "2024-05-08T13:57:00Z",
      "signals": {"upvotes": 1448, "downvotes": 1372, "reports": 32},
      "score": 71.3,
      "status": "inbox"
    },
    {
      "id": "fcc-net-neutrality",
      "title": "FCC net neutrality return",
      "context": "The FCC voted 3-2 to restore Title II net neutrality rules, reclassifying broadband as a utility. Ars Technica and CNET report ISPs plan lawsuits claiming the agency exceeded its authority.",
      "sideA": "Open internet advocates urge courts to uphold the rules, saying telecom consolidation makes enforceable protections essential.",
      "sideB": "Broadband providers seek a stay, arguing heavy-handed regulation will slow rural build-outs and 5G upgrades.",
      "tags": ["tech policy", "regulation", "consumer"],
      "submittedBy": "spectrumwatch",
      "createdAt": "2024-05-09T09:24:00Z",
      "signals": {"upvotes": 1187, "downvotes": 1129, "reports": 20},
      "score": 67.8,
      "status": "inbox"
    },
    {
      "id": "openai-safety-governance",
      "title": "OpenAI safety board shakeup",
      "context": "OpenAI dissolved its Superalignment team and faced resignations over safety priorities, per the New York Times and Semafor. Critics say product launches outpace risk mitigation after the board ousted Sam Altman last fall.",
      "sideA": "AI ethicists urge regulators to investigate OpenAI's disclosures, arguing the company misled partners about internal guardrails.",
      "sideB": "OpenAI defends its structure, saying a refreshed safety board and external audits provide sufficient oversight while innovation continues.",
      "tags": ["ai", "governance", "ethics"],
      "submittedBy": "alignment_alert",
      "createdAt": "2024-05-10T16:40:00Z",
      "signals": {"upvotes": 1334, "downvotes": 1215, "reports": 26},
      "score": 69.5,
      "status": "inbox"
    },
    {
      "id": "prop22-benefits-audit",
      "title": "California gig worker benefits audit",
      "context": "California's state auditor said ride-hailing companies underfunded Prop 22 health stipends, a finding covered by CalMatters and the Los Angeles Times. Drivers report confusing paperwork while platforms insist compliance is on track.",
      "sideA": "Gig worker coalitions want the state to suspend Prop 22 and force companies to classify drivers as employees until stipends improve.",
      "sideB": "The platforms ask for more time to refine reporting, noting the audit spans the pandemic and ignores new company bonuses.",
      "tags": ["labor", "transportation", "gig economy"],
      "submittedBy": "ridesharewatch",
      "createdAt": "2024-05-11T12:22:00Z",
      "signals": {"upvotes": 1016, "downvotes": 934, "reports": 15},
      "score": 61.7,
      "status": "inbox"
    },
    {
      "id": "eu-china-ev-tariff",
      "title": "EU tariffs on Chinese EVs",
      "context": "The European Commission proposed provisional tariffs up to 38% on Chinese-made electric cars after a subsidy probe. Bloomberg and Politico Europe note EU automakers fear retaliation while climate groups warn of higher EV prices.",
      "sideA": "European automakers urge Brussels to go ahead, saying unfair subsidies flood the market and threaten domestic jobs.",
      "sideB": "Clean transport advocates want a narrower tariff, arguing collaboration on cheaper EVs is vital to hit emissions targets.",
      "tags": ["trade", "automotive", "climate"],
      "submittedBy": "brusselsbrief",
      "createdAt": "2024-05-12T08:17:00Z",
      "signals": {"upvotes": 912, "downvotes": 988, "reports": 18},
      "score": 57.9,
      "status": "inbox"
    },
    {
      "id": "microplastics-bottle-ban",
      "title": "Microplastics bottle ban proposal",
      "context": "California lawmakers advanced a bill banning single-use plastic water bottles at state facilities after studies found microplastics in bloodstreams. The Sacramento Bee and Guardian report bottlers warn of cost spikes while health groups cite long-term risks.",
      "sideA": "Environmental coalitions push for the ban, saying refill infrastructure is ready and microplastics science demands aggressive action.",
      "sideB": "Beverage companies request a phased approach with recycling incentives, arguing an outright ban disrupts emergency preparedness.",
      "tags": ["environment", "public health", "regulation"],
      "submittedBy": "ecoledger",
      "createdAt": "2024-05-13T15:03:00Z",
      "signals": {"upvotes": 845, "downvotes": 732, "reports": 14},
      "score": 55.6,
      "status": "inbox"
    },
    {
      "id": "arizona-water-pause",
      "title": "Arizona homebuilding water pause",
      "context": "Arizona halted new home approvals in parts of the West Valley after a state model showed groundwater deficits. KJZZ and the Arizona Republic say developers argue the data is outdated while residents fear wells running dry.",
      "sideA": "Developers ask the court to lift the pause, citing private pipeline projects and accusing regulators of politicizing growth.",
      "sideB": "Water conservation groups defend the moratorium, insisting aquifers need time to recharge and new builds should wait for recycled supplies.",
      "tags": ["water", "housing", "climate"],
      "submittedBy": "desertdata",
      "createdAt": "2024-05-14T09:58:00Z",
      "signals": {"upvotes": 732, "downvotes": 705, "reports": 9},
      "score": 51.3,
      "status": "inbox"
    },
    {
      "id": "georgia-fundraising-limit",
      "title": "Georgia election fundraising rules",
      "context": "Georgia lawmakers advanced a bill letting the governor's leadership committee raise unlimited funds during special sessions. The Atlanta Journal-Constitution and Georgia Public Broadcasting note Democrats call it unfair while Republicans cite transparency.",
      "sideA": "Reform groups want the courts to strike the bill, warning it entrenches incumbents and skirts campaign finance caps.",
      "sideB": "Supporters say leadership committees already disclose donors and the change simply clarifies rules for election-year sessions.",
      "tags": ["elections", "campaign finance", "state politics"],
      "submittedBy": "peach_state_watch",
      "createdAt": "2024-05-15T18:44:00Z",
      "signals": {"upvotes": 612, "downvotes": 598, "reports": 12},
      "score": 49.2,
      "status": "inbox"
    },
    {
      "id": "starlink-ukraine-access",
      "title": "Starlink frontline access dispute",
      "context": "Ukrainian commanders told the Financial Times that Starlink terminals intermittently lost service near the front, while Elon Musk said export controls limit use. BBC and Forbes cover competing claims about military coordination and payment.",
      "sideA": "Ukraine asks SpaceX and allied governments to guarantee uninterrupted service, arguing communications outages risk lives.",
      "sideB": "SpaceX insists restrictions prevent escalation and wants written assurances terminals won't support offensive drones beyond agreed zones.",
      "tags": ["defense", "satellite", "policy"],
      "submittedBy": "orbitbrief",
      "createdAt": "2024-05-16T07:36:00Z",
      "signals": {"upvotes": 1288, "downvotes": 1207, "reports": 23},
      "score": 68.8,
      "status": "inbox"
    },
    {
      "id": "baltimore-bridge-rebuild",
      "title": "Key Bridge rebuild cost split",
      "context": "After the Dali cargo ship collapse, Maryland officials proposed a $1.7 billion rebuild funded mostly by federal dollars. The Baltimore Sun and CNBC note insurers dispute liability while port workers plead for a rapid timeline.",
      "sideA": "State leaders want Congress to cover the full rebuild, citing national supply chain stakes and precedent from past disasters.",
      "sideB": "Fiscal conservatives demand insurers and the shipping company pay first, warning taxpayers shouldn't shoulder corporate negligence.",
      "tags": ["infrastructure", "economy", "transportation"],
      "submittedBy": "portpulse",
      "createdAt": "2024-05-17T10:20:00Z",
      "signals": {"upvotes": 1399, "downvotes": 1315, "reports": 28},
      "score": 70.4,
      "status": "inbox"
    },
    {
      "id": "nj-offshore-wind-reboot",
      "title": "New Jersey offshore wind reboot",
      "context": "After Ørsted canceled two offshore wind projects, New Jersey reopened bids with richer subsidies. NJ.com and Reuters report residents worry about views and whales while unions highlight clean energy jobs.",
      "sideA": "Renewable advocates urge the state to double down on offshore wind, citing federal tax credits and climate commitments.",
      "sideB": "Coastal homeowner groups seek a moratorium, arguing new subsidies socialize corporate risk and tourism losses.",
      "tags": ["energy", "climate", "economy"],
      "submittedBy": "shoreline_signal",
      "createdAt": "2024-05-18T14:57:00Z",
      "signals": {"upvotes": 804, "downvotes": 765, "reports": 16},
      "score": 56.7,
      "status": "inbox"
    },
    {
      "id": "texas-grid-winterization",
      "title": "Texas grid winterization costs",
      "context": "ERCOT proposed new reliability rules requiring generators to add fuel reserves before winter, a move covered by the Houston Chronicle and Bloomberg. Retail providers warn ratepayers will face higher bills after Uri-era surcharges.",
      "sideA": "Consumer advocates push regulators to mandate the upgrades now, arguing deadly outages can't repeat even if bills rise modestly.",
      "sideB": "Power plant owners seek phased compliance and financing support, saying sudden mandates could push smaller operators into bankruptcy.",
      "tags": ["energy", "resilience", "regulation"],
      "submittedBy": "gridwatch",
      "createdAt": "2024-05-19T08:02:00Z",
      "signals": {"upvotes": 742, "downvotes": 711, "reports": 13},
      "score": 53.9,
      "status": "inbox"
    },
    {
      "id": "chicago-migrant-shelters",
      "title": "Chicago migrant shelter closures",
      "context": "Chicago set deadlines to clear temporary shelters for migrants bused from Texas, citing budget strains. The Chicago Tribune and WBEZ detail neighborhood tensions over reassigning families during storm season.",
      "sideA": "Immigrant rights groups want the city to pause evictions until permanent housing is secured, pointing to unused federal funds.",
      "sideB": "City budget officials argue deadlines are needed to transition people into work programs and keep costs from ballooning.",
      "tags": ["immigration", "housing", "local policy"],
      "submittedBy": "lakefrontledger",
      "createdAt": "2024-05-20T13:18:00Z",
      "signals": {"upvotes": 918, "downvotes": 884, "reports": 22},
      "score": 58.8,
      "status": "inbox"
    },
    {
      "id": "alabama-ivf-protection",
      "title": "Alabama IVF immunity debate",
      "context": "After the state Supreme Court ruled frozen embryos are children, lawmakers passed temporary immunity for IVF clinics. AL.com and CBS report advocates disagree on whether the fix protects patients or invites more lawsuits.",
      "sideA": "Fertility doctors ask for permanent legal shields, warning patients may flee the state and embryos could be seized as evidence.",
      "sideB": "Pro-life groups push for tighter embryo storage rules, saying immunity bills ignore the court's recognition of embryo personhood.",
      "tags": ["health", "law", "family"],
      "submittedBy": "southernbrief",
      "createdAt": "2024-05-21T09:50:00Z",
      "signals": {"upvotes": 1345, "downvotes": 1288, "reports": 31},
      "score": 69.9,
      "status": "inbox"
    },
    {
      "id": "canada-meta-news-block",
      "title": "Canada vs Meta news block",
      "context": "Meta continues blocking Canadian news links on Facebook and Instagram after Ottawa's Online News Act took effect. CBC and the Globe and Mail report publishers struggling to reach readers while Meta says the law forces unsustainable payments.",
      "sideA": "Canadian media urge regulators to penalize Meta and enforce bargaining, arguing the block starves local journalism.",
      "sideB": "Meta insists the law should be amended, saying linking fees distort the open web and the company already drives traffic for free.",
      "tags": ["media", "platforms", "law"],
      "submittedBy": "maple_monitor",
      "createdAt": "2024-05-22T15:07:00Z",
      "signals": {"upvotes": 802, "downvotes": 744, "reports": 19},
      "score": 56.1,
      "status": "inbox"
    },
    {
      "id": "us-anti-book-ban-bill",
      "title": "U.S. anti-book ban legislation",
      "context": "House Democrats reintroduced the Books Save Lives Act tying federal funding to library access, while Republicans call it federal overreach. The Hill and Education Week detail rising challenges in multiple states.",
      "sideA": "Civil liberties groups back the bill, saying Congress must protect intellectual freedom when states target marginalized authors.",
      "sideB": "State leaders oppose the bill, arguing local school boards—not Washington—should decide age-appropriate materials.",
      "tags": ["education", "federal policy", "speech"],
      "submittedBy": "capitolwatch",
      "createdAt": "2024-05-23T11:11:00Z",
      "signals": {"upvotes": 721, "downvotes": 699, "reports": 10},
      "score": 52.8,
      "status": "inbox"
    },
    {
      "id": "california-ai-safety-bill",
      "title": "California AI safety standards bill",
      "context": "California lawmakers advanced SB 1047 requiring high-capability AI developers to implement shutdown switches and report safety incidents. CalMatters and TechCrunch note startups fear compliance costs while safety researchers cheer oversight.",
      "sideA": "Safety advocates push for swift passage, arguing state standards can fill federal gaps before AGI-level systems appear.",
      "sideB": "Tech founders want the bill narrowed to avoid chilling open-source models and forcing expensive audits on small labs.",
      "tags": ["ai", "regulation", "innovation"],
      "submittedBy": "safetechledger",
      "createdAt": "2024-05-24T09:29:00Z",
      "signals": {"upvotes": 1156, "downvotes": 1104, "reports": 25},
      "score": 65.7,
      "status": "inbox"
    },
    {
      "id": "uk-rwanda-plan",
      "title": "UK Rwanda asylum plan",
      "context": "Britain's Parliament passed legislation declaring Rwanda a safe third country to restart deportation flights. The Guardian and BBC report legal challenges from refugee charities citing human rights violations.",
      "sideA": "Home Office officials want immediate flights, claiming the deterrent is needed to stop small-boat crossings in the Channel.",
      "sideB": "Human rights lawyers seek injunctions, arguing Rwanda's record fails international standards and asylum claims deserve UK review.",
      "tags": ["immigration", "human rights", "international"],
      "submittedBy": "londonledger",
      "createdAt": "2024-05-25T08:41:00Z",
      "signals": {"upvotes": 1388, "downvotes": 1427, "reports": 37},
      "score": 68.5,
      "status": "inbox"
    },
    {
      "id": "skorea-med-strike",
      "title": "South Korea medical student strike",
      "context": "Tens of thousands of trainee doctors resigned to protest Seoul's plan to boost medical school quotas. Yonhap and Reuters report patients facing delayed surgeries while the government warns of licenses being suspended.",
      "sideA": "Patients' rights groups back the expansion, saying South Korea's aging population needs more doctors despite short-term disruption.",
      "sideB": "Medical associations demand negotiations, arguing sudden quota hikes degrade training quality and rural staffing won't improve.",
      "tags": ["health", "labor", "international"],
      "submittedBy": "seoulwatch",
      "createdAt": "2024-05-26T12:34:00Z",
      "signals": {"upvotes": 1115, "downvotes": 1192, "reports": 18},
      "score": 62.5,
      "status": "inbox"
    },
    {
      "id": "australia-misinformation-bill",
      "title": "Australia misinformation fines",
      "context": "Australia's parliament debated a bill fining social platforms for failing to curb misinformation. ABC News and the Sydney Morning Herald note digital rights groups fear censorship while officials cite foreign interference threats.",
      "sideA": "Government ministers press for strong penalties, arguing unchecked conspiracies erode elections and public health guidance.",
      "sideB": "Free speech advocates urge narrower rules, saying the bill lets regulators decide truth and punish satire or political dissent.",
      "tags": ["speech", "platforms", "policy"],
      "submittedBy": "oceania_observer",
      "createdAt": "2024-05-27T09:46:00Z",
      "signals": {"upvotes": 864, "downvotes": 903, "reports": 15},
      "score": 57.2,
      "status": "inbox"
    },
    {
      "id": "nz-smoking-repeal",
      "title": "New Zealand smokefree repeal",
      "context": "New Zealand's new government moved to repeal a world-first law banning tobacco sales to future generations. RNZ and the Guardian report health groups outraged while retailers applaud relief from compliance costs.",
      "sideA": "Health advocates urge parliament to keep the smokefree law, citing modeling that predicted thousands of lives saved.",
      "sideB": "Convenience store owners support the repeal, arguing illicit markets grew and the ban hurt small business revenue.",
      "tags": ["health", "policy", "business"],
      "submittedBy": "kiwipulse",
      "createdAt": "2024-05-28T07:55:00Z",
      "signals": {"upvotes": 993, "downvotes": 921, "reports": 14},
      "score": 60.9,
      "status": "inbox"
    },
    {
      "id": "germany-heating-ban",
      "title": "Germany heating law backlash",
      "context": "Germany's revised Building Energy Act phases out new oil and gas boilers, pushing heat pumps instead. Deutsche Welle and Politico Europe say homeowners protest costs while Greens call it vital for climate goals.",
      "sideA": "Climate groups support strict deadlines and subsidies, arguing Germany must hit its 2030 emissions targets.",
      "sideB": "Property owners request delays and larger grants, claiming installers are booked out and rural residents rely on oil heat.",
      "tags": ["climate", "housing", "economy"],
      "submittedBy": "berlinbrief",
      "createdAt": "2024-05-29T10:02:00Z",
      "signals": {"upvotes": 902, "downvotes": 977, "reports": 20},
      "score": 58.1,
      "status": "inbox"
    },
    {
      "id": "india-election-content",
      "title": "India election social media takedowns",
      "context": "During India's national elections, the government ordered platforms to remove deepfakes and opposition posts. Al Jazeera and the Times of India highlight debates over censorship versus combating falsehoods.",
      "sideA": "Ruling party officials defend takedowns as necessary to stop foreign-backed disinformation during polling.",
      "sideB": "Opposition parties and digital rights groups seek judicial review, arguing the orders suppress criticism and lack transparency.",
      "tags": ["elections", "speech", "international"],
      "submittedBy": "delhidesk",
      "createdAt": "2024-05-30T16:18:00Z",
      "signals": {"upvotes": 1473, "downvotes": 1392, "reports": 36},
      "score": 72.4,
      "status": "inbox"
    },
    {
      "id": "kenya-finance-bill-protests",
      "title": "Kenya finance bill protests",
      "context": "Kenya's 2024 finance bill proposes new taxes on fuel and bread, sparking street protests. Nation Media and Reuters report youth groups calling it punitive while the government argues IMF-backed reforms are needed.",
      "sideA": "Civil society leaders demand the tax hikes be withdrawn, warning the cost of living crisis will deepen.",
      "sideB": "Treasury officials insist the levies are necessary to stabilize debt and fund infrastructure, promising targeted subsidies.",
      "tags": ["economy", "taxes", "international"],
      "submittedBy": "nairobibureau",
      "createdAt": "2024-05-31T12:07:00Z",
      "signals": {"upvotes": 1034, "downvotes": 1101, "reports": 22},
      "score": 62.2,
      "status": "inbox"
    },
    {
      "id": "nigeria-crypto-crackdown",
      "title": "Nigeria crypto platform crackdown",
      "context": "Nigeria detained Binance executives and hiked taxes on crypto trades, blaming currency speculation for naira volatility. Bloomberg and CoinDesk report traders shifting to peer-to-peer markets as regulators double down.",
      "sideA": "Nigeria's central bank urges strict enforcement, saying speculative flows undermine monetary policy and fuel inflation.",
      "sideB": "Crypto advocacy groups seek court relief, arguing the crackdown drives innovation offshore and punishes legitimate remittances.",
      "tags": ["finance", "crypto", "regulation"],
      "submittedBy": "lagospulse",
      "createdAt": "2024-06-01T09:43:00Z",
      "signals": {"upvotes": 876, "downvotes": 923, "reports": 19},
      "score": 57.4,
      "status": "inbox"
    },
    {
      "id": "brazil-fake-news-bill",
      "title": "Brazil fake news bill showdown",
      "context": "Brazil's Congress revived the Fake News Bill forcing platforms to pay for journalism and remove harmful content quickly. Folha de S.Paulo and AP report tech firms threaten to cut services while lawmakers cite January 8 riot lessons.",
      "sideA": "Brazilian lawmakers push for passage, saying platforms must be accountable for viral misinformation that incites violence.",
      "sideB": "Tech companies warn the bill creates liability for legitimate speech and incentivizes over-removal of political content.",
      "tags": ["media", "regulation", "international"],
      "submittedBy": "saopaulodesk",
      "createdAt": "2024-06-02T11:55:00Z",
      "signals": {"upvotes": 945, "downvotes": 1008, "reports": 21},
      "score": 59.6,
      "status": "inbox"
    },
    {
      "id": "japan-overtime-cap",
      "title": "Japan overtime cap dispute",
      "context": "Japan tightened overtime caps for truck drivers under the '2024 problem' reforms. Nikkei Asia and NHK report logistics firms warning of delivery delays while unions say fatigue deaths necessitate limits.",
      "sideA": "Labor unions support strict caps with government subsidies for automation and rail freight to prevent karoshi cases.",
      "sideB": "Trucking associations seek temporary exemptions, arguing retailers will face shortages and rural areas lack alternatives.",
      "tags": ["labor", "transport", "international"],
      "submittedBy": "tokyobrief",
      "createdAt": "2024-06-03T08:30:00Z",
      "signals": {"upvotes": 812, "downvotes": 768, "reports": 14},
      "score": 55.8,
      "status": "inbox"
    },
    {
      "id": "france-snap-election",
      "title": "France snap election debate",
      "context": "President Macron dissolved parliament after European election losses, calling snap legislative polls. Le Monde and France24 note centrists fear a far-right surge while supporters hail the democratic reset.",
      "sideA": "Macron allies defend the snap vote as a chance to renew a governing mandate and stop parliamentary paralysis.",
      "sideB": "Opposition parties say the move gambles with stability and demand a caretaker government focus on cost-of-living relief.",
      "tags": ["politics", "elections", "international"],
      "submittedBy": "pariswatch",
      "createdAt": "2024-06-04T19:12:00Z",
      "signals": {"upvotes": 1184, "downvotes": 1217, "reports": 26},
      "score": 63.1,
      "status": "inbox"
    },
    {
      "id": "israel-judicial-overhaul",
      "title": "Israel judicial overhaul reprise",
      "context": "Israel's government signaled it will revisit judicial overhaul bills once the Gaza war subsides, per Haaretz and the Jerusalem Post. Protest leaders vow weekly rallies while coalition partners insist reforms are essential.",
      "sideA": "Civic groups urge shelving the overhaul permanently, arguing independence of the Supreme Court is critical during wartime.",
      "sideB": "Coalition hardliners push to finish the reforms, saying the court has overreached and blocked security legislation for years.",
      "tags": ["democracy", "courts", "international"],
      "submittedBy": "telavivdesk",
      "createdAt": "2024-06-05T13:45:00Z",
      "signals": {"upvotes": 1562, "downvotes": 1488, "reports": 39},
      "score": 75.4,
      "status": "inbox"
    },
    {
      "id": "global-ai-guardrails",
      "title": "Global AI guardrails summit",
      "context": "Leaders from the U.S., EU, and Asia met in Seoul for the AI Safety Summit follow-up, debating voluntary vs. binding rules. Reuters and MIT Technology Review note China wants equal footing while civil society urges enforceable audits.",
      "sideA": "Policy makers push for a binding international registry of advanced models with shared red-team results before deployment.",
      "sideB": "Industry coalitions prefer voluntary commitments, warning rigid treaties will slow beneficial AI research and entrench incumbents.",
      "tags": ["ai", "international", "policy"],
      "submittedBy": "globaltechbrief",
      "createdAt": "2024-06-06T09:21:00Z",
      "signals": {"upvotes": 1045, "downvotes": 994, "reports": 18},
      "score": 63.9,
      "status": "inbox"
    },
    {
      "id": "montana-youth-climate",
      "title": "Montana youth climate order appeal",
      "context": "Montana appealed a landmark ruling that the state must consider climate impacts when approving fossil fuel projects. The Associated Press and High Country News detail fossil firms warning of job losses while youth plaintiffs celebrate.",
      "sideA": "Youth plaintiffs urge the state Supreme Court to uphold the order, saying constitutional rights to a healthy environment must be enforced.",
      "sideB": "State officials seek reversal, arguing courts should not dictate energy policy and the ruling creates regulatory uncertainty.",
      "tags": ["climate", "youth", "law"],
      "submittedBy": "bigskywatch",
      "createdAt": "2024-06-07T12:48:00Z",
      "signals": {"upvotes": 913, "downvotes": 876, "reports": 12},
      "score": 58.6,
      "status": "inbox"
    },
    {
      "id": "scotus-social-moderation",
      "title": "Supreme Court social media moderation cases",
      "context": "The Supreme Court is reviewing Florida and Texas laws that limit how platforms moderate political speech. The Washington Post and SCOTUSblog say the justices seem skeptical but outcomes remain murky.",
      "sideA": "State officials argue platforms operate as common carriers and should not censor lawful viewpoints, especially conservative content.",
      "sideB": "Tech companies and civil rights groups seek to strike the laws, warning they compel hosting of harmful propaganda and spam.",
      "tags": ["speech", "tech policy", "courts"],
      "submittedBy": "legalnet",
      "createdAt": "2024-06-08T08:39:00Z",
      "signals": {"upvotes": 1705, "downvotes": 1618, "reports": 44},
      "score": 79.1,
      "status": "inbox"
    },
    {
      "id": "philly-safe-injection",
      "title": "Philadelphia safe injection site fight",
      "context": "Philadelphia halted Safehouse's supervised injection site plan after neighborhood lawsuits, even as overdose deaths climb. WHYY and Stat News report city council split between harm reduction and community opposition.",
      "sideA": "Public health advocates petition for a pilot site, citing evidence from Canada and Rhode Island that supervised consumption saves lives.",
      "sideB": "Neighborhood groups want a ban, arguing sites attract crime and city resources should focus on treatment beds instead.",
      "tags": ["health", "public safety", "local"],
      "submittedBy": "delawarevalley",
      "createdAt": "2024-06-09T14:27:00Z",
      "signals": {"upvotes": 876, "downvotes": 941, "reports": 17},
      "score": 56.4,
      "status": "inbox"
    },
    {
      "id": "puertorico-grid-privatization",
      "title": "Puerto Rico grid privatization audit",
      "context": "Puerto Rico's oversight board ordered a review of LUMA Energy's contract after ongoing blackouts. El Nuevo Día and Reuters note residents question privatization while the company blames aging infrastructure and storms.",
      "sideA": "Community groups demand the contract be revoked, saying LUMA failed to improve reliability despite rate hikes and federal aid.",
      "sideB": "LUMA urges patience, arguing the grid overhaul needs long-term investment and political interference disrupts progress.",
      "tags": ["infrastructure", "energy", "governance"],
      "submittedBy": "islandledger",
      "createdAt": "2024-06-10T11:14:00Z",
      "signals": {"upvotes": 942, "downvotes": 901, "reports": 19},
      "score": 59.8,
      "status": "inbox"
    },
    {
      "id": "hawaii-water-rights",
      "title": "Hawai'i water rights restoration",
      "context": "In the wake of Maui's 2023 wildfires, state regulators moved to restore traditional water flows to Native Hawaiian farmers, drawing pushback from resort operators. Hawaii News Now and Civil Beat cover the clash over stream diversions feeding hotel landscaping.",
      "sideA": "Native Hawaiian leaders seek immediate enforcement of water restoration orders, saying cultural practices and wildfire resilience depend on healthy streams.",
      "sideB": "Resort associations request phased implementation, warning sudden cutoffs jeopardize jobs and water recycling projects underway.",
      "tags": ["environment", "indigenous rights", "tourism"],
      "submittedBy": "pacificpulse",
      "createdAt": "2024-06-11T09:33:00Z",
      "signals": {"upvotes": 1008, "downvotes": 956, "reports": 20},
      "score": 60.5,
      "status": "inbox"
    }
  ]
}
